[{"author":{"name":"@mihcall","avatar":"/images/IdenticonHandler.ashx?code=173747702"},"date":"(11/15/2010 5:18 PM)","text":"\r\n\t\t\t\t\tKeep on doing this crazy, great stuff. I hope to see you talking on future conferences. You're one of my favourite speakers at #oredev.\r\n\t\t\t\t"},{"author":{"name":"Rob Ashton","avatar":"http://www.gravatar.com/avatar.php?gravatar_id=b6a6693f03003f7ab0f9b0882e9c2dde&size=50&default=identicon"},"date":"(11/15/2010 5:22 PM)","text":"\r\n\t\t\t\t\tMadness :) - Thanks, it means a lot to get +ve feedback from people, talking at a large event like this was very intimidating indeed.\r\n\t\t\t\t"},{"author":{"name":"rafek","avatar":"http://www.gravatar.com/avatar.php?gravatar_id=7c3b45d8f867a5e405f8bb54424e2fdd&size=50&default=identicon"},"date":"(11/15/2010 6:18 PM)","text":"\r\n\t\t\t\t\tIt was nice to meet u there. I'd definitely try RavenDB in the nearest future - it was pleasure to attend your tuesday tutorial on RavenDB. See u next year - I hope!\r\n\t\t\t\t"},{"author":{"name":"Jan Stenberg","avatar":"http://www.gravatar.com/avatar.php?gravatar_id=61f10f36d13fb28bf04f80741b136dd0&size=50&default=identicon"},"date":"(11/15/2010 7:24 PM)","text":"\r\n\t\t\t\t\tI really enjoyed the workshop and learnt a lot. It was great getting this insight into RavenDB and be able to try it out with some guidance. Hope to see you at some future conference. QCon in London, March 2011 maybe? Also a very very good conference.\r\n\t\t\t\t"},{"author":{"name":"Air Max Pas Cher","avatar":"http://www.gravatar.com/avatar.php?gravatar_id=902ab7d8aea76a43ba92a9df4d7d235b&size=50&default=identicon"},"date":"(11/1/2011 3:05 AM)","text":"\r\n\t\t\t\t\tSo now it has turned out to be more economical TN Requin Pas Cher as you would find out low-priced Jordan shoes on sale; starting from of $50 to $65 for one pair of shoes and $35 to $48 if anyone purchase in Chaussures Aire Max 2009 large quantity. We can see various websites that will present inexpensive Jordan shoes with free charge of shipping. The above stated costs might not be for all Air Jordan assortments as there will be a Chaussures Aire Max 24-7 few collectors' special version also. But if you are searching for an unusual piece; it is suggested to go for direct purchase than ordering online. If you will Search online then you will have to go through many websites, which will give further inclusive information about all these products. You can get information from different forums,Chaussure Air Max 2011 Pas Cher Homme which converses about these products in detail.foolpig1101\r\n\t\t\t\t"}]