[{"author":{"name":"Stefano","avatar":"http://www.gravatar.com/avatar.php?gravatar_id=644d1d5f44bb4eb2a3cd2939f432a6f8&size=50&default=identicon"},"date":"(10/10/2010 9:26 PM)","text":"\r\n\t\t\t\t\tHi Rob,watching your session was quite funny and entertaining and you managed the difficulties well :), I think at the end it was a good introduction to FNH!Actually, for the next time :}, in Italian keyboard you need to press just 3 keys for a curly brace (Alt Gr + shift + square brace), once you learn them it's not too difficult... there are worst things, such as writing with a macbook keyboard!!Bye :}\r\n\t\t\t\t"},{"author":{"name":"Simone","avatar":"http://www.gravatar.com/avatar.php?gravatar_id=444625287c652a4e31f4a271905b713a&size=50&default=identicon"},"date":"(10/10/2010 9:47 PM)","text":"\r\n\t\t\t\t\tThank you for coming: it was great having you at the event.\r\n\t\t\t\t"},{"author":{"name":"Gian Maria","avatar":"http://www.gravatar.com/avatar.php?gravatar_id=3dcd57258231846be4070cd4ed89ea60&size=50&default=identicon"},"date":"(10/11/2010 8:47 AM)","text":"\r\n\t\t\t\t\tIt was a pleasure to have dinner with you and oren :) it was really fun.  For the next event I'll manage to remember to take with us some adaptor and a Virtual Machine with Bare Visual STudio with no addin, I really understand how it is difficult to work in other laptop :). Thanks a lot for coming, and if I'll come in England some time, I'll contact you, maybe we could do a One day programming session in pub :) as you told us during the dinner.For the passport I have a question, since UK is in EU, did you really need a passport to come in Italy? When I went to UK for vacation I only needed my Italian ID card with me :).Alk.\r\n\t\t\t\t"},{"author":{"name":"Rob Ashton","avatar":"http://www.gravatar.com/avatar.php?gravatar_id=b6a6693f03003f7ab0f9b0882e9c2dde&size=50&default=identicon"},"date":"(10/11/2010 9:10 AM)","text":"\r\n\t\t\t\t\tAah, spreading the word of pub-programming? I'd only be too happy to oblige :)We don't have an ID card in Britain, so Passport is the only way we can travel :(\r\n\t\t\t\t"},{"author":{"name":"cheap bags","avatar":"http://www.gravatar.com/avatar.php?gravatar_id=671f4f85047c650a91ca781a5b0bf803&size=50&default=identicon"},"date":"(10/1/2011 5:54 AM)","text":"\r\n\t\t\t\t\tThank you today for my these, we must always heart is a thankful heart, so I'm happy every day, hope you also so!!!!!cheap bags\r\n\t\t\t\t"},{"author":{"name":"Achat Supra","avatar":"http://www.gravatar.com/avatar.php?gravatar_id=030b67f1d74aa73886ca83b0361d1f13&size=50&default=identicon"},"date":"(10/26/2011 5:09 AM)","text":"\r\n\t\t\t\t\tDifferent styles of Achat Supra is available on our website now, featuring the latest design, fashionable colorways, supple and comfortable materials and so on.\r\n\t\t\t\t"},{"author":{"name":"moncelr","avatar":"http://www.gravatar.com/avatar.php?gravatar_id=9b82e8ebe5b7bfda700055af2c493d88&size=50&default=identicon"},"date":"(10/27/2011 10:28 AM)","text":"\r\n\t\t\t\t\tselect which designs handbags such as Gucci moncler, and so on. In winter moncler outlet, you can choose accoutrements to mix with your jackets, the anorak advice humans to build self-confidence for themselves. People are absorbed i\r\n\t\t\t\t"}]