[{"author":{"name":"Paul Cowan","avatar":"http://www.gravatar.com/avatar.php?gravatar_id=5b9872f3076db04cb2ffb516091d80d0&size=50&default=identicon"},"date":"(4/11/2010 7:56 AM)","text":"\r\n\t\t\t\t\tFunny how you never mentioned nbuilder when you were promoting the \"new\" project.\r\n\t\t\t\t"},{"author":{"name":"Terry Brown","avatar":"http://www.gravatar.com/avatar.php?gravatar_id=5faac5e340a7461a337b02f31d57f7cc&size=50&default=identicon"},"date":"(4/11/2010 11:23 AM)","text":"\r\n\t\t\t\t\twell said Rob!I'm a big fan of doing things because I want to, be it to learn, to improve practice (my own), or to just 'play'.I've never gotten around to launching anything, though the fact that you've gone public with something you're playing with should be applauded, not criticised.keep it up :)\r\n\t\t\t\t"},{"author":{"name":"robashton","avatar":"http://www.gravatar.com/avatar.php?gravatar_id=b6a6693f03003f7ab0f9b0882e9c2dde&size=50&default=identicon"},"date":"(4/11/2010 12:01 PM)","text":"\r\n\t\t\t\t\t@Paul I don't really see how that's relevant, I said it was a bank holiday doodle-around and I was only releasing it because it's better than the alternative of not releasing it. I've done nothing differently here to in previous subjects of code discussion on this blog.Personally, I think you're being a bit of a troll right now =)@Terry - thanks, I think that's the stance that most people have over on this topic - thankfully!Imagine if everybody was as hostile about it as Paul has been (the author of the blog post to which I refer), people would be terrified of releasing anything.I don't think that's a good thing at all.\r\n\t\t\t\t"},{"author":{"name":"Paul Cowan","avatar":"http://www.gravatar.com/avatar.php?gravatar_id=5b9872f3076db04cb2ffb516091d80d0&size=50&default=identicon"},"date":"(4/12/2010 9:07 AM)","text":"\r\n\t\t\t\t\tIf having a different opinion makes me a troll then I am a troll.\r\n\t\t\t\t"},{"author":{"name":"robashton","avatar":"http://www.gravatar.com/avatar.php?gravatar_id=b6a6693f03003f7ab0f9b0882e9c2dde&size=50&default=identicon"},"date":"(4/15/2010 11:06 AM)","text":"\r\n\t\t\t\t\tIt's not your opinion, it's the way you express it.Not only that, but it's clear that you didn't really look into AP before making that the prime example in your blog entry.The overall design and goal of AP is different to the other test data builders, and using a two day old project's feature-set to compare against the existing software without reading further is always going to give the impression that there is nothing new in there.The conventions, up-front-configuration, identical test-data per test run, data sources and etc are not in the other frameworks make AP rather different.The way AP has been built means that the behaviour of any aspect of the system can be changed by chopping in a different set of conventions, using a different configuration source, swapping in a different factory.This is all useful, and that I've already had three contribution requests is a sign that I'm getting something right.Making rash assumptions to make a sensationalist blog entry about something that isn't really a major problem (Yes, home-rolling IOC containers is getting a little old now) is certainly not far from trolling.You appear to have done the same when judging Fubu too, which is a shame - because it's a rather well designed project compared to what MS have given us with their attempt at an MVC framework.\r\n\t\t\t\t"}]