[{"author":{"name":"Gareth Mark Elms","avatar":"http://www.gravatar.com/avatar.php?gravatar_id=945120cdf5ebca0a0077bb113af72c1a&size=50&default=identicon"},"date":"(8/28/2010 3:50 PM)","text":"\r\n\t\t\t\t\tLove this series it's helping me to understand Orchard CMS so thanks for sharing. Do you stand by the MvcEx project as is? Noticed it hasn't been updated since January\r\n\t\t\t\t"},{"author":{"name":"robashton","avatar":"http://www.gravatar.com/avatar.php?gravatar_id=b6a6693f03003f7ab0f9b0882e9c2dde&size=50&default=identicon"},"date":"(8/28/2010 4:13 PM)","text":"\r\n\t\t\t\t\t\"Stand by it\", we use it in our product at work, but I still just consider it to be a reference implementation of one way you could do pluggable controllers.It was a little bit too \"pure\" IMO, and an implementation where you simply \"chose\" which controller to use instead of crap loads of reflection would be a little more pragmatic :)I'm done with MS MVC for the longterm though, rather than move to MVC2/MVC3, when we upgrade, we'll be switching to Fubu, which will allow us to do a lot of this kind of thing out of the box.\r\n\t\t\t\t"},{"author":{"name":"mvcvm","avatar":"http://www.gravatar.com/avatar.php?gravatar_id=022eb8288d85f0beef4732440aea1363&size=50&default=identicon"},"date":"(8/7/2011 6:37 PM)","text":"\r\n\t\t\t\t\tIn my research on MVC3 design for plugin modules, i became aware of your discussion of Multi-Tenancy design viz ASP.NET projects.I was a bit surprised for this reason:IIS like most web servers allow hosting of multiple sites with separate worker pools. Each site may be composed of modules from a common codebase as you require. I believe they will run in their own AppDomain which is good for privacy and isolation, and if not mistaken, it is even possible to compose two variant sites by pointing to selections of virtual directories, effectively sharing resources.What you are attempting may be attractive to a market segment, but they would be taking on risks to privacy, availability etcThis is not meant as a criticism, as your articles (I am yet to finish the series) are useful to me by being thought-provoking. It would be enlightening to hear your response. Thank you!\r\n\t\t\t\t"}]