[{"author":{"name":"Bart Czernicki","avatar":"http://www.gravatar.com/avatar.php?gravatar_id=f2fbdc6722a747b791658e37592f4757&size=50&default=identicon"},"date":"(3/15/2011 7:11 PM)","text":"\r\n\t\t\t\t\tI think all this stuff is great and will enable HTML5 RIA-like applications, but the BIGGEST question is how will this run on mobile browsers and support for gestures. Why?  Because if the mobile experience sucks for HTML5/gestures and can't compete with native iPhone/Android apps this will never take off.  Because if you are limited to the desktop/laptop..then I can write Silverlight or Flash applications which are several revs already in delivering these features (i.e. GPU acceleration, vector based printing, sockets, Silverlight can scale to 8 cores, parallel libaries in Silverlight etc.)\r\n\t\t\t\t"},{"author":{"name":"robashton","avatar":"http://www.gravatar.com/avatar.php?gravatar_id=b6a6693f03003f7ab0f9b0882e9c2dde&size=50&default=identicon"},"date":"(3/16/2011 11:26 AM)","text":"\r\n\t\t\t\t\tThe mobile experience sucks for HTML5/gestures *now*, but as more and more apps move to this way of thinking it'll improve (Already is to an extent with libraries like: http://plugins.jquery.com/plugin-tags/gesture )I do think that any learning or experimenting _now_ is important, but only because it'll be useful in the _future_ :-)\r\n\t\t\t\t"},{"author":{"name":"fschwiet","avatar":"http://www.gravatar.com/avatar.php?gravatar_id=6a69d8c12aadd1052a5a65cb9023e783&size=50&default=identicon"},"date":"(3/16/2011 5:18 PM)","text":"\r\n\t\t\t\t\tI apologize if I mentioned this before, but if you're writing a lot of javascript then I'd encourage you to try using Jasmine (http://pivotal.github.com/jasmine/) as your test language.  Its great.  The jasmine google group has some discussions specific to node.js testing though I haven't followed them.\r\n\t\t\t\t"},{"author":{"name":"robashton","avatar":"http://www.gravatar.com/avatar.php?gravatar_id=b6a6693f03003f7ab0f9b0882e9c2dde&size=50&default=identicon"},"date":"(3/16/2011 5:34 PM)","text":"\r\n\t\t\t\t\tI suspect I shall - although I don't really like BDD style frameworks - I prefer to practise outside in testing from more traditional test-method-based unit testing.One of the big take-homes from this was that testing is seriously important, and I wish I'd done it on this project.\r\n\t\t\t\t"},{"author":{"name":"rafek","avatar":"http://www.gravatar.com/avatar.php?gravatar_id=7c3b45d8f867a5e405f8bb54424e2fdd&size=50&default=identicon"},"date":"(9/16/2011 8:59 AM)","text":"\r\n\t\t\t\t\tThis is just awesome! I'd like to see some codez here.\r\n\t\t\t\t"}]