[{"author":{"name":"Nicklas","avatar":"http://www.gravatar.com/avatar.php?gravatar_id=774bca6596d08f3cd4fbbd5d81022400&size=50&default=identicon"},"date":"(11/24/2010 9:07 AM)","text":"\r\n\t\t\t\t\tThanks for doing this image gallery project. Thanks to this I've started to create my own blog using ravendb and are using your code as a reference. It's helping me learn alot, not just about ravendb but of TDD as well as MVC.\r\n\t\t\t\t"},{"author":{"name":"robashton","avatar":"http://www.gravatar.com/avatar.php?gravatar_id=b6a6693f03003f7ab0f9b0882e9c2dde&size=50&default=identicon"},"date":"(11/24/2010 9:47 AM)","text":"\r\n\t\t\t\t\tAbsolutely my pleasure :)Caveat: Don't take anything I do for gospel, especially the TDD elements - I'm a self professed \"not very good tester\" and I'm still struggling to balance value with coverage.\r\n\t\t\t\t"},{"author":{"name":"Doug","avatar":"http://www.gravatar.com/avatar.php?gravatar_id=93e8da5522a9878c3cc86021093f834f&size=50&default=identicon"},"date":"(11/24/2010 4:08 PM)","text":"\r\n\t\t\t\t\tI have drawn a lot of inspiration from your project and really appreciate the effort you are putting into it. I'm still struggling a bit to shift my thinking and embrace RavenDB but on a whole what you are presenting here has been very helpful.  Thank you.\r\n\t\t\t\t"},{"author":{"name":"TN Requin pas cher","avatar":"http://www.gravatar.com/avatar.php?gravatar_id=1645f2a9df4bf55d87f905d6603c305c&size=50&default=identicon"},"date":"(11/1/2011 3:05 AM)","text":"\r\n\t\t\t\t\tIn 1985 Nike turns up with a TN pas cher brand of shoes for the awesome basketball player Michael Jordan which transformed the NBA accessories' world. Ever since then Nike is manufacturing Chaussures Aire Max BW Jordan shoe each year under Jordan Brand as Air Jordan series. Now there has been more than twenty five series of Air Jordan opening with Air Jordan I to Air Jordan 2011. But what makes the Air Jordan so extraordinary? It is in the name of a celebrity, but there is a lot to the Jordon shoes than just the name. When Nike contacted Jordon, he required the ideal Chaussures Aire Max LTD shoes for the players who not at all compromise with the quality, ease and the style the player are worthy of. These are the accurate features with Jordon shoes that make it so exclusive and attract everybody towards it, and if it is an inexpensive Jordon shoe, is a certainly done deal.Air Jordan shoes are a must have in your collection chaussure aire max tn requin pas cher Homme list. foolpig1101  \r\n\t\t\t\t"}]