[{"author":{"name":"Fatal","avatar":"/images/IdenticonHandler.ashx?code=-631672450"},"date":"(4/8/2010 1:32 PM)","text":"\r\n\t\t\t\t\thi Rob,looks interesting. Could you please compare/contrast your project with nBuilder? It seems to exist for the same purpose although possibly different directions on the fluent side of things.cheersFatal\r\n\t\t\t\t"},{"author":{"name":"robashton","avatar":"http://www.gravatar.com/avatar.php?gravatar_id=b6a6693f03003f7ab0f9b0882e9c2dde&size=50&default=identicon"},"date":"(4/8/2010 1:37 PM)","text":"\r\n\t\t\t\t\tThere are a few striking differences, notably in the pre-configuration side of things - but indeed also in the fluent language used  to create the objects.I think it's a bit early to be drawing comparisons, because I'm building something that I want to use - and it's not really there yet.Tell you what - when I reach 0.5, I'll write a blog entry and describe what I feel are the main differences between this and NB :)\r\n\t\t\t\t"},{"author":{"name":"robashton","avatar":"http://www.gravatar.com/avatar.php?gravatar_id=b6a6693f03003f7ab0f9b0882e9c2dde&size=50&default=identicon"},"date":"(4/8/2010 1:38 PM)","text":"\r\n\t\t\t\t\tAnd of course, the conventions that I'll be using to drive the setting of recognised properties are something that is going to be *very* different.\r\n\t\t\t\t"},{"author":{"name":"Giedrius","avatar":"http://www.gravatar.com/avatar.php?gravatar_id=ab457a1472a803502ebbabb9a811d2d9&size=50&default=identicon"},"date":"(4/8/2010 4:10 PM)","text":"\r\n\t\t\t\t\tvery nice.one thing though, would it be possible to spice up automatic configuration, let's say for string property values use not null, but property name (plus index if it's a collection or smth)? For simple numeric properties property index or smth, that would help catch mapping errors very quickly :)\r\n\t\t\t\t"},{"author":{"name":"robashton","avatar":"http://www.gravatar.com/avatar.php?gravatar_id=b6a6693f03003f7ab0f9b0882e9c2dde&size=50&default=identicon"},"date":"(4/8/2010 4:16 PM)","text":"\r\n\t\t\t\t\tWell that would just be a matter of replacing the default conventions with your own.If nobody else does it, I could easily write a set as a contrib module\r\n\t\t\t\t"}]